<template>
  <div class="service__container">
  <v-card
    width="80%"
    height="100%"
  >
    <v-tabs
      v-model="tab"
      background-color="transparent"
      class="d-flex justify-center"
    >
      <v-tab
        v-for="item in items"
        :key="item.tab"
      >
        {{ item.tab }}
      </v-tab>
    </v-tabs>

    <v-tabs-items v-model="tab">
      <v-tab-item
        v-for="item in items"
        :key="item.tab"
      >
        <template>
          <v-card>
            <v-card-title>
              <v-spacer />
              <v-text-field
                v-model="search"
                append-icon="search"
                label="Search"
                single-line
                hide-details
              ></v-text-field>
            </v-card-title>
            <v-data-table
              :headers="shownHeaders"
              :items="shownServices"
              :search="search"
              hide-default-footer
              :hide-default-header="$vuetify.breakpoint.xs"
            ></v-data-table>
          </v-card>
        </template>
      </v-tab-item>
    </v-tabs-items>
  </v-card>
  </div>
</template>

<script>
  export default {
    name: "index.vue",
    data () {
      return {
        tab: 0,
        items: [
          { tab: 'Безкоштовні', content: 'free'},
          { tab: 'Платні', content: 'paid'},
        ],
        search: '',
        headers: [
          {
            text: 'Послуга',
            align: 'left',
            value: 'name',
            sortable: false,
            paid: false,
          },
          {
            text: 'Ціна (грн)',
            align: 'left',
            value: 'price',
            sortable: false,
            paid: true,
          },
        ],
        services: [
          {
            name: 'медична практика',
            price: '',
            paid: false
          },
          {
            name: 'забезпечення права громадян на вільний вибір лікаря з надання первинної медичної допомоги у визначеному законодавством порядку;\n' +
              ' надання невідкладної медичної допомоги пацієнтам, які не потребують екстреної, вторинної (спеціалізованої) або третинної (високоспеціалізованої) медичної допомоги',
            price: '',
            paid: false
          },
          {
            name: 'планування, організація, участь та контроль за проведенням профілактичних оглядів та диспансеризації населення, здійснення профілактичних заходів',
            price: '',
            paid: false
          },
          {
            name: 'діагностика та забезпечення лікування хвороб, травм, отруєнь, патологічних, фізіологічних (під час вагітності) станів;\n' +
              'консультації щодо профілактики, діагностики, лікування хвороб, травм, отруєнь, патологічних, фізіологічних станів (під час вагітності),\n' +
              ' а також щодо ведення здорового способу життя',
            price: '',
            paid: false
          },
          {
            name: 'організація стаціонарозамінних форм надання медичної допомоги(послуги денного стаціонару)',
            price: '',
            paid: false
          },
          {
            name: 'взаємодія з суб’єктами надання вторинної (спеціалізованої) та третинної (високоспеціалізованої) медичної допомоги з метою своєчасного діагностування та забезпечення дієвого лікування хвороб, травм, отруєнь, патологічних, фізіологічних (під час вагітності) станів з урахуванням особливостей стану здоров’я пацієнта',
            price: '',
          },
          {
            name: 'організація відбору та спрямування хворих на консультацію та лікування до закладів охорони здоров’я та установ, що надають вторинну (спеціалізовану) та третинну (високоспеціалізовану) медичну допомогу, а також відбору хворих на санаторно-курортне лікування та реабілітацію у визначеному законодавством порядку',
            price: '',
            paid: false
          },
          {
            name: 'закупівля, зберігання та використання ресурсів, необхідних для надання медичних послуг, зокрема лікарських засобів , обладнання та інвентарю',
            price: '',
            paid: false
          },
          {
            name: 'координація діяльності лікарів із надання первинної медичної допомоги з іншими суб’єктами надання медичної допомоги, зокрема закладами вторинної та третинної медичної допомоги, санаторіїв, а також з іншими службами, що опікуються добробутом населення, зокрема соціальна служба, та правоохоронними органами',
            price: '',
            paid: false
          },
          {
            name: 'надання елементів паліативної допомоги пацієнтам на останніх стадіях перебігу невиліковних захворювань, яка включає комплекс заходів, спрямованих на полегшення фізичних та емоційних страждань пацієнтів, моральну підтримку членів їх сімей',
            price: '',
          },
          {
            name: 'проведення заходів з попередження і своєчасного виявлення захворювань, зменшення рівня ускладнень, інвалідності та смертності населення, в першу чергу від попереджувальних захворювань та станів',
            price: '',
            paid: false
          },
          {
            name: 'моніторинг виконання та фінансового забезпечення державних соціальних нормативів із забезпечення населення первинною медико-санітарною допомогою',
            price: '',
            paid: false
          },
          {
            name: 'вивчення, аналіз і прогнозування показників стану здоров\'я населення та участь у розробці заходів, спрямованих на збереження і покращення здоров’я населення',
            price: '',
            paid: false
          },
          {
            name: 'організація та проведення з’їздів, конгресів, симпозіумів, науковопрактичних конференцій, наукових форумів, круглих столів, семінарів тощо',
            price: '',
            paid: false
          },
          {
            name: 'УЗД серця, щитоподібної залози, гінекологічне',
            price: '',
            paid: false
          },
          {
            name: 'лабораторні обстеження',
            price: '240',
            paid: true
          },
        ],
      }
    },
    computed: {
      shownServices() {
        if(this.tab === 0) {
          return this.services.filter(({paid}) => !paid)
        } else {
          return this.services.filter(({paid}) => paid)
        }
      },
      shownHeaders() {
        if(this.tab === 0) {
          return this.headers.filter(({paid}) => !paid)
        } else {
          return this.headers;
        }
      }
    }
  }
</script>

<style scoped>
  .service__container {
    padding: 120px 0 50px 0;
    min-height: 85vh;
    display: flex;
    justify-content: center;
  }
</style>
